IN_DIME = 10
HIDDEN_DIM = 10
N_LAYER = 1
OUT_DIM = 10
LR = 0.2
INDEX_DIVIDE = 5
COLUMN_DIVIDE = 4

ENTITY_DICT = {
    "橱窗": 10001,
    "入口": 10002,
    "推广": 10003,
    "试衣间": 10004,
    "夏男女袜": 10005,
    "秋拖": 10006,
    "双肩包": 10007,
    "小饰品": 10008,
    "收银台": 10009,
    "矩框": 10010,
    "楼梯间": 10011,
    "库房": 10012,
    "门口": 10013,
    "包": 10014
}

SEASON_CODE = {
    "春": 20,
    "秋": 20,
    "夏": 35,
    "冬": 0
}

SOLAR_TERMS = {
    "立春": "2月3日",
    "雨水": "2月18日",
    "惊蛰": "3月5日",
    "春分": "3月20日",
    "清明": "4月4日",
    "谷雨": "4月19日",
    "立夏": "5月5日",
    "小满": "5月20日",
    "芒种": "6月5日",
    "夏至": "6月21日",
    "小暑": "7月7日",
    "大暑": "7月22日",
    "立秋": "8月6日",
    "处暑": "8月22日",
    "白露": "9月7日",
    "秋分": "9月22日",
    "寒露": "10月7日",
    "霜降": "10月23日",
    "立冬": "11月7日",
    "小雪": "11月22日",
    "大雪": "12月7日",
    "冬至": "12月21日",
    "小寒": "1月5日",
    "大寒": "1月19日",
}

FESTIVAL_TERMS = {
    "圣诞": "12月25日",
    "情人节": "2月14日"
}

CONTEXT_DICT = {
    "season": "春",
    "solar": "寒露",
    "rain": 5,
    "economics": 5,
    "temperature": 5,
    "bandit": 5
}


